feat: docs docs, common more docs
